In [5]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(11)

In [6]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [7]:
df

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

In [51]:
df["W"]
type(df['W'])

pandas.core.series.Series

In [20]:
df.X

A   -0.286073
B   -0.319631
C   -1.065603
D    0.561192
E    1.574634
Name: X, dtype: float64

In [23]:
df["new"] = df.W+df.X

In [24]:
df

          W         X         Y         Z       new
A  1.749455 -0.286073 -0.484565 -2.653319  1.463382
B -0.008285 -0.319631 -0.536629  0.315403 -0.327916
C  0.421051 -1.065603 -0.886240 -0.475733 -0.644552
D  0.689682  0.561192 -1.305549 -1.119475  1.250874
E  0.736837  1.574634 -0.031075 -0.683447  2.311471

In [27]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

In [28]:
df

          W         X         Y         Z       new
A  1.749455 -0.286073 -0.484565 -2.653319  1.463382
B -0.008285 -0.319631 -0.536629  0.315403 -0.327916
C  0.421051 -1.065603 -0.886240 -0.475733 -0.644552
D  0.689682  0.561192 -1.305549 -1.119475  1.250874
E  0.736837  1.574634 -0.031075 -0.683447  2.311471

In [31]:
df.drop('B')

          W         X         Y         Z       new
A  1.749455 -0.286073 -0.484565 -2.653319  1.463382
C  0.421051 -1.065603 -0.886240 -0.475733 -0.644552
D  0.689682  0.561192 -1.305549 -1.119475  1.250874
E  0.736837  1.574634 -0.031075 -0.683447  2.311471

In [36]:
df.loc[['A','B'],['W','Z']]

          W         Z
A  1.749455 -2.653319
B -0.008285  0.315403

In [39]:
df.iloc[0:4,3:]

          Z       new
A -2.653319  1.463382
B  0.315403 -0.327916
C -0.475733 -0.644552
D -1.119475  1.250874

In [44]:
len(df.drop('W', axis = 1))

5

In [49]:
df

          W         X         Y         Z       new
A  1.749455 -0.286073 -0.484565 -2.653319  1.463382
B -0.008285 -0.319631 -0.536629  0.315403 -0.327916
C  0.421051 -1.065603 -0.886240 -0.475733 -0.644552
D  0.689682  0.561192 -1.305549 -1.119475  1.250874
E  0.736837  1.574634 -0.031075 -0.683447  2.311471

In [71]:
df[df>0]

          W         X   Y         Z       new
A  1.749455       NaN NaN       NaN  1.463382
B       NaN       NaN NaN  0.315403       NaN
C  0.421051       NaN NaN       NaN       NaN
D  0.689682  0.561192 NaN       NaN  1.250874
E  0.736837  1.574634 NaN       NaN  2.311471

In [72]:
df[(df['W']>0) & (df['Y']<0)]['X']

A   -0.286073
C   -1.065603
D    0.561192
E    1.574634
Name: X, dtype: float64

In [76]:
df.loc[]

W      1.749455
X     -0.286073
Y     -0.484565
Z     -2.653319
new    1.463382
Name: A, dtype: float64

In [77]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [78]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [91]:
emp = df.groupby('Empresa')

In [89]:
emp.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [115]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [120]:
pd.concat([esquerda, direita], axis = 1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [122]:
pd.merge(esquerda, direita, how = "inner", on = "key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [123]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [132]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [131]:
type(df)

list